import {
  heroDesktop,
  heroTablet,
  heroFull,
  teacherGongBig,
  teacherGongSm,
} from "../assets";

export const navLinks = [
  {
    id: "Teaching Style",
    title: "教學方式",
  },
  {
    id: "reviews",
    title: "學生評論",
  },
  {
    id: "trial",
    title: " 預定試教",
  },
  {
    id: "teaching philosophy",
    title: "教學理念",
  },
];

export const heroSection = {
  id: "hero",
  photoSmall: teacherGongSm,
  photoBig: teacherGongBig,
  teacherName: "STEVEN 龔少",
  tagline: "英文家教老師",
  phoneLink: "tel:0987-988258",
  phone: "0987-988258",
  lineLink: "https://line.me/ti/p/RfSH-I3Agq",
  line: "luvwinnie7969",
  backgroundSmall: heroTablet,
  backgroundLarge: heroDesktop,
  backgroundXL: heroFull,
};

export const experience = {
  headerEng: "Teaching philosophy",
  headerCn: "教學理念",
  word1: "經驗",
  paragraph1:
    "我曾在多家補習班與公立學校教過英文，教學對象下至四歲，上至五十歲。因此，在目前的教育環境下，從學習的角度出發，英語學習者在學習過程中會有哪些瓶頸，會有哪些負面情緒，我都深有體悟；從教學的角度出發，補教業及學校教育體制會有哪些不足，會有哪些教學錯誤，我也相當清楚。因此，針對學習者，我除了提供更有效的學習方式，也會幫助調適學習者的心態；而身為教學者，我也會盡力彌補一般英語教學的不足，並導正不當的教學方式。讓英語學習者在學習的路上多點樂趣，少點壓力，乃至學出興趣，是我致力想做到的事。",
  word2: "教學",
  paragraph2:
    "語言學來就是要用的。即便學習英語的目的是為了升學或考取證照，而非是為了加強口說能力，學習者還是應該以「說」為基礎去學習英語，因為唯有如此，才能打下良好的學習基礎，並有能力在日後記更多的單字，或學更多的文法。為此，我特別設計出「口語化教學」，以最直接的方式，幫助學習者提升口說能力，並在最大程度上，輔助學習者在校取得好成績及考取證照。口語化的教學主要是以「句子」為單位，教導學習者中翻英的轉換技巧。然而，因為中翻英的考試只出現在學測與研究所的考試上，所以一直不被英語教學者所重視。",
  word3: "自學",
  paragraph3:
    "從小三到國三，我雖也都有補習英文，但在補習班教我英文的老師主要都是外師。老實說，居多的外師並不懂如何教英文，但因為他們能提供最直接的英語使用環境，所以只要英語學習者有一定的「自學能力」，就能在與外國人的接觸當中，打下良好的英文基礎。然而，有自學能力的人並不多，尤其在目前這種「把英語當學科」的教育環境下，學習者要有正確的學習方式都很難了，更別提要自學。因此，如何培養學生的自學能力，是我教學的重中之重。學習英語畢竟是一條漫漫長路，若不培養一定的自學能力，終究難以習得英語這項語言。靠山山倒，靠人人老，靠自己最好！",
};

export const reviews = [
  {
    id: "review 1",
    name: "Yueh Sia Li",
    content: "老師用中翻英的方式，重新再上過一次港明學校教的內容，讓我更清楚，也更記得住學校教的文法。口語式的訓練，也更能將單字背熟。",
  },
  {
    id: "review 2",
    name: "匿名",
    content: "學生可以自己選擇課程主題，再根據老師準備的逐字稿教材上課。老師會講解句子的內容和有難度的單字與片語，以及母語人士與外語學習者在發音上的差異，遇到文法也會特別提出來解說，最後也有時間做主題內容相關的口語問答，讓學生有口說的機會，也可以聽到老師的反饋和想法，整個課程下來可以學到很多。",
  },
  {
    id: "review 3",
    name: "Israel",
    content: "老師他擅長口語教學，通過反覆對話訓練和中翻英練習，可以大大提升了英語口語能力和信心。相比傳統教學，這種方法相對實用、有效，一步一腳印取得的進步讓人很有成就感。推薦給希望提高口語水平的同學。",
  },
  {
    id: "review 4",
    name: "Justin",
    content: "因為基礎不好，長期在補習班上也都沒什麼進步，給Steven老師教之後，才發現是連音、拼音的基本功沒建立好，文法也用太複雜的方式去記，學習英文的習慣也不對，才會導致進步緩慢、越學越累的狀況。才上沒多久的課，還不確定進步多少，但至少老師讓我覺得學英文是快樂、輕鬆的。",
  },
  {
    id: "review 5",
    name: "曉芳",
    content: "一開始想說這老師打扮也太像明星，到底會不會教啊?結果上課後發現老師很親切，有點靦腆,但說起英文就眼神發亮，反差很大。老師的教學經驗很多，我是社會人士，有些讀寫的基礎，但是發音真的需要矯正。上班族需要惡補的，可以先找老師討論想要的教學方式,像我是要上台簡報，還要回覆一些英文的mail，可以帶來跟老師討論。雖然現在可透過AI學英文，但有經驗又會教的老師，可以馬上糾正發音，讓學生觸類旁通，我覺得還是很不一樣的，所以特別來推薦一下囉！順帶一提，跟老師深聊後，可以理解為什麼在學校任職不適合他，因為他教的教法太特別了，但又很實用， 教學重點在讓學生可以跟外國人對話，而不單只是為了考試。當然，要升學或是考證照，對老師來說，我覺得是一塊小蛋糕啦！",
  },
  {
    id: "review 6",
    name: "仲佑",
    content:
      "老師教學認真，非常有耐心的指導學員的觀念與口說技巧，例如一些時態能用比較好理解的方式讓人記憶。",
  },
  {
    id: "review 7",
    name: "Yi Wen Wang",
    content: "老師教學認真，文法和構句也都可以清楚說明。",
  },
  {
    id: "review 8",
    name: "Jerry",
    content: "不管你是要學英文的聽說讀寫，甚至是罵，Steven老師都能把你訓練到熟能生巧，讓你把英文運用在你的生活上。跟著老師學中英翻譯，一定能讓你的英文在生活會話中是實用的。",
  },
  {
    id: "review 9",
    name: "Eddie",
    content:
      "經驗豐富的老師，不會死板的教文法，而是由口說為主，重視說話的邏輯。可以找自己有興趣的主題，客製化上課，要學習流利的口說與連音就找Steven！",
  },
  {
    id: "review 10",
    name: "Perry",
    content: "老師很親切細心且有耐心，上起課不會很有壓力。",
  },
  {
    id: "review 11",
    name: "匿名",
    content: "可以感受出老師教學的熱忱 會不斷地補充內容講解 並適時的給予糾正。",
  },
  {
    id: "review 12",
    name: "匿名",
    content: "上課速度不會太快，每一部分都會確認學生是否有哪裡不懂的，有問題老師都很樂意花時間幫忙解答!!",
  },
];

export const booking = {
  headerEng: "Book a Trial",
  headerCn: "預定試教",
  buttonCn: "馬上預定 免費試教!",
  link: "https://cal.com/teachersteven",
  headerSmall: "預定免費試教",
  text: "口語式教學不同於學校和補習班的教學方式。我至今旁聽多位老師教英語，仍未曾見過類似的教學方式，所以建議學習者可先與我透過簡單的面談，大致了解口語式教學與一般教學的差異所在，順便可在面談中提出自身的學習需求，而雖然教學過程，大體是以口語式教學為主，但仍會隨時根據學習者的狀況，做出適當的調整。面談時間為30分。如需試教，可預約45分鐘的時間。面談與試教均不收費，歡迎預約了解詳情。",
}

export const advantages = [
  {
    id: "adv 1",
    title: "學習模式",
    contentPositive: "反覆的英文對談加上中翻英訓練",
    contentNegative: "反復的考試與補考",
  },
  {
    id: "adv 2",
    title: "檢驗成效的方法",
    contentPositive: "每次英語對談都可自行檢驗",
    contentNegative: "僅可透過分數檢驗",
  },
  {
    id: "adv 3",
    title: "學習信心",
    contentPositive: "越常講英文，英語能力必定越提升，信心也會隨之增加",
    contentNegative: "考試未必每次都能過分，而一旦拿低分可能就倍感挫折",
  },
  {
    id: "adv 4",
    title: "學習速度",
    contentPositive:
      "初期學習速度雖較慢，但單字不易忘，文法觀念也具統整性，在後期能培養出強烈語感，學習速度也隨之加快",
    contentNegative:
      "初期學習速度較快，但單字也忘得快，且文法觀念支離破碎，導致後期難以應付大型考試，學習速度隨之大降",
  },
  {
    id: "adv 5",
    title: "單字與文法的學習",
    contentPositive:
      "照音拼字，並將文法結構簡化，知道單字與文法的哪些部分無法對應中文，進而大幅降低中文的干擾，更直接的學習英語",
    contentNegative:
      "死記每個單字的字母與複雜的文法結構，並用中文去逐字對應單字與文法，誤將中英文看成對等的語言，造成諸多學習障礙",
  },
];
